In [1]:
import pandas as pd

In [2]:
emp = pd.read_csv('employees.csv')

In [3]:
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [6]:
emp.columns = [cn.replace(" ","_").lower() for cn in emp.columns]

In [7]:
emp.columns

Index(['first_name', 'gender', 'start_date', 'last_login_time', 'salary',
       'bonus_%', 'senior_management', 'team'],
      dtype='object')

In [10]:
emp.query('first_name == "Douglas"')

,first_name,gender,start_date,last_login_time,salary,bonus_%,senior_management,team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
217,Douglas,Male,9/3/1999,4:00 PM,83341,1.015,True,Client Services
322,Douglas,Male,1/8/2002,6:42 PM,41428,14.372,False,Product
667,Douglas,NaN,2/4/2009,2:03 AM,104496,14.771,True,Marketing
835,Douglas,Male,8/4/2007,5:23 AM,132175,2.280,False,Engineering

In [ ]:
emp.filter()